tests/load/discovery-map.load.yml
config:
  target: "http://localhost:3000"
  phases:
    - name: "warmup"
      duration: 30
      arrivalRate: 1
    - name: "ramp"
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: "sustained"
      duration: 120
      arrivalRate: 20
    - name: "spike"
      duration: 30
      arrivalRate: 50
  defaults:
    headers:
      Content-Type: "application/json"
      Authorization: "Bearer {{ $processEnvironment.TEST_USER_TOKEN }}"
  processor: "./helpers/discovery-helpers.js"
  plugins:
    expect: {}
  ensure:
    thresholds:
      - "http.response_time.p99 < 2000"
      - "http.response_time.p95 < 1000"
      - "http.response_time.p50 < 500"
  variables:
    native_languages:
      - "en"
      - "es"
      - "fr"
      - "de"
      - "ja"
      - "ko"
      - "zh"
      - "pt"
      - "ar"
      - "ru"
    target_languages:
      - "es"
      - "fr"
      - "en"
      - "ja"
      - "ko"
      - "it"
    proficiency_levels:
      - "A1"
      - "A2"
      - "B1"
      - "B2"
      - "C1"
      - "C2"
    sort_options:
      - "best_match"
      - "newest"
      - "nearest"
      - "online_now"
    countries:
      - "United Kingdom"
      - "United States"
      - "Spain"
      - "France"
      - "Japan"
    cities:
      - "London"
      - "New York"
      - "Madrid"
      - "Paris"
      - "Tokyo"
    genders:
      - "male"
      - "female"
      - "other"

scenarios:
  # ── Core Discovery Endpoints ──────────────────────────────────────────

  - name: "Partner search (basic)"
    weight: 15
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/partners"
          qs:
            native_languages: "{{ native_languages }}"
            target_language: "{{ target_languages }}"
          expect:
            - statusCode: 200

  - name: "Partner search with location"
    weight: 12
    beforeRequest:
      - "beforeRequest"
    flow:
      - function: "generateRandomLatitude"
      - function: "generateRandomLongitude"
      - get:
          url: "/api/discovery/partners"
          qs:
            latitude: "{{ latitude }}"
            longitude: "{{ longitude }}"
            radius_metres: 50000
          expect:
            - statusCode: 200

  - name: "Partner search with all filters"
    weight: 8
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/partners"
          qs:
            native_languages: "{{ native_languages }}"
            target_language: "{{ target_languages }}"
            level: "{{ proficiency_levels }}"
            sort: "{{ sort_options }}"
            serious_learner_only: false
            age_min: 18
            age_max: 60
            country: "{{ countries }}"
            city: "{{ cities }}"
            has_audio_intro: true
          expect:
            - statusCode: 200

  - name: "Partner search (serious learners only)"
    weight: 6
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/partners"
          qs:
            serious_learner_only: true
            sort: best_match
          expect:
            - statusCode: 200

  - name: "Partner search with gender filter (VIP)"
    weight: 5
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/partners"
          qs:
            gender: "{{ genders }}"
            sort: newest
          expect:
            - statusCode: 200

  - name: "Partner search with availability filters"
    weight: 4
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/partners"
          qs:
            availability_morning: true
            availability_evening: true
            sort: best_match
          expect:
            - statusCode: 200

  # ── Language Pair Matching ────────────────────────────────────────────

  - name: "Language pair search"
    weight: 10
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/language-pair"
          qs:
            native_language: "{{ native_languages }}"
            target_language: "{{ target_languages }}"
            sort: "{{ sort_options }}"
            page: 0
            limit: 20
          expect:
            - statusCode: 200

  - name: "Language pair search with advanced filters"
    weight: 6
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/language-pair"
          qs:
            native_language: "{{ native_languages }}"
            target_language: "{{ target_languages }}"
            level: "{{ proficiency_levels }}"
            sort: best_match
            page: 0
            limit: 50
            has_audio_intro: true
            country: "{{ countries }}"
            city: "{{ cities }}"
          expect:
            - statusCode: 200

  - name: "Language pair search (voice room active)"
    weight: 4
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/language-pair"
          qs:
            native_language: ja
            target_language: en
            voice_room_active: true
            sort: online_now
          expect:
            - statusCode: 200

  # ── Public Discovery Endpoints ────────────────────────────────────────

  - name: "Get Partner of the Week"
    weight: 8
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/partner-of-week"
          expect:
            - statusCode: 200

  - name: "Get recent native speakers"
    weight: 6
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/recent-native-speakers"
          expect:
            - statusCode: 200

  - name: "Get spotlight users"
    weight: 6
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/spotlight"
          expect:
            - statusCode: 200

  # ── Audio Intros Discovery ────────────────────────────────────────────

  - name: "Audio intros search"
    weight: 5
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/audio-intros"
          qs:
            native_languages: "{{ native_languages }}"
            target_language: "{{ target_languages }}"
          expect:
            - statusCode: 200

  # ── Degradation-aware Discovery Endpoints ─────────────────────────────

  - name: "Get degradation status"
    weight: 3
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/degradation-status"
          expect:
            - statusCode: 200

  - name: "Partner search with degradation marker"
    weight: 4
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/partners-with-degradation"
          qs:
            native_languages: "{{ native_languages }}"
            target_language: "{{ target_languages }}"
            sort: best_match
          expect:
            - statusCode: 200

  # ── Location-Based Search ─────────────────────────────────────────────

  - name: "Location search by country"
    weight: 3
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/search-by-location"
          qs:
            country: "{{ countries }}"
          expect:
            - statusCode: 200

  - name: "Location search by country and city"
    weight: 2
    beforeRequest:
      - "beforeRequest"
    flow:
      - get:
          url: "/api/discovery/search-by-location"
          qs:
            country: United Kingdom
            city: London
          expect:
            - statusCode: 200